sdcStressTest.yml
config:
  processor: './stressTestScript.js'
  target: 'http://localhost:3005'
  phases:
    - duration: 10
      arrivalRate: 1 #1 virtual user in 10 seconds, aka 10 users
    - duration: 10
      arrivalRate: 10 #10 virtual users every second in span of 10 seconds aka 100 total users 
    - duration: 10
      arrivalRate: 100 #100 users every second in span of 10 seconds aka 1000 total
    - duration: 10
      arrivalRate: 1000 #1000 users every second in span of 10 seconds aka 10,000 total
scenarios:
  - name: "Searching Courses By ID"
    flow: #call stressTestScript.js generateRandomData() to create the fake info
      - function: 'generateRandomData'
      - get:
          url: "/{{ id }}"